<a href="https://colab.research.google.com/github/Peckkie/DPDM2021/blob/main/Data101(Chapter2).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

###pandas คือ packege ที่มีคนพัฒนาขึ้นมาเพื่อใช้จัดการข้อมูลที่มีลักษณะเป็นตารางซึ่งใน pandas เรียกว่า dataframe

In [ ]:
import pandas #import pandas ->  คีร์เวิดที่จะบอกว่าเราจะใช้ packege อะไร  โหลด packege ที่ชื่อว่า pandas มาใช้
import pandas as pd #โหลด packege ที่ชื่อว่า pandas เเล้วตั้งชื่อว่า  pd

###ไฟล์ .CSV (csv -> comma separated values)

In [ ]:
data_df = pd.read_csv('/content/data.csv') #เปิดไฟล์ csv ตาม localation (path/เส้นทาองของไฟล์) ของ ไฟล์
data_df

   car_id        model  year   value  pers_id
0     101      Bentley  1973  100000        1
1     102  Rolls Royce  1965  330000        1
2     103      Peugeot  1993     500        3